[{"description":"Build full Luiz Laffey Productions website based on this comprehensive spec:\n\n**DESIGN SYSTEM:**\n- Colors: Black (#0a0a0a), Gold (#d4a843), Cobalt Blue (#0047ab)\n- Typography: Cormorant Garamond for headings, Outfit for body\n- Animations: Fade-in effects, hover transitions\n\n**NAVIGATION:**\nHome | About | Services | Portfolio | Originals | Plans | Contact\n\n**PAGES TO CREATE:**\n\n1. **HOME (/)**: Hero with tagline, services preview (4 cards: Dubbing, Voice-Over, Translation, Subtitling), Originals teaser with both radio shows, testimonials section, contact CTA. Hero buttons: 'Explore Our Services' → /services, 'View Our Work' → /portfolio. NO standalone audio player on home.\n\n2. **ABOUT (/about)**: Company story - Luiz Laffey Productions is a creative production company at the intersection of storytelling, sound, language, and culture. Founded by Luiz Laffey with 20+ years experience in voice acting, dubbing, radio broadcasting, music curation. Include mission pillars, philosophy section ('good production is invisible'), team info. NO phone number, NO location.\n\n3. **SERVICES (/services)**: Overview of Voiceover (SAG-AFTRA standards), Dubbing (Luiz is Head of Languages at Angel Studios), Localization/Translation services. 'View Portfolio' buttons linking to /portfolio. 'Get a Quote' CTA.\n\n4. **PORTFOLIO (/portfolio)**: Public showcase for professional work - Dubbing reels (before/after, multilingual), Voiceover demos (commercial, documentary, e-learning), Subtitling examples, Translation samples, Client work highlights.\n\n5. **ORIGINALS (/originals)**: Radio programs hub. Show both programs with their official logos and descriptions. Cards for: Zero Point Zero (orange/cosmic aesthetic) and Luiz Laffey's Collection (gold/warm aesthetic). Both cards link to individual show pages. Add enhanced brightness/contrast filters to images.\n\n6. **ORIGINALS - LUIZ LAFFEY'S COLLECTION (/originals/luiz-laffeys-collection)**: Show page with hero using neon card branding, full description ('More than a radio show — it's a musical journey. Disco, funk, soulful house, nu-disco with storytelling'), host profiles with enhanced photos:\n   - Luiz Laffey (Host, Curator & Storyteller) - 40+ years DJ experience\n   - Alexis Hart (Co-Host, Storyteller & Connector) - spontaneous, curious energy\n   Free samples section (5 clips + 1 full episode), Member library preview (locked), Subscribe CTA.\n\n7. **ORIGINALS - ZERO POINT ZERO (/originals/zero-point-zero)**: Show page with orange/cosmic aesthetic, 60-minute cosmic journey through electronic music since 1990s. Host profiles with enhanced photos:\n   - Paulinho Ribeiro (Host & Creator) - career since 1987\n   - Tony Caldeira (DJ & Producer) - fitness entrepreneur, radio enthusiast since 1990\n   - Nilton Rabello (DJ & Vinyl Curator) - 1500+ vinyl records, lives in Philadelphia\n   - Caio Eduardo (Technical Support)\n   Free samples + member library.\n\n8. **PLANS (/plans)**: Radio station licensing focus (B2B for broadcasters). Title: 'Universal Radio Subscription Offer' - 'Premium radio programming. Licensed. Ready to air.'\n   Two tiers:\n   - Standard ($9.99/month): Full access + generic promo materials\n   - Annual Broadcaster ($99/year): Custom promotional materials for station\n   Benefits: No production costs, consistent delivery, professional content, easy integration.\n   CTA: 'Subscribe, download your first episode, and put it on air this week.'\n   FAQ section for broadcaster concerns.\n\n9. **CONTACT (/contact)**: Contact form (name, email, message - NO phone field), contact info showing ONLY email: contact@luizlaffeyproductions.com. NO phone, NO address, NO map, NO business hours.\n\n10. **LOGIN (/login)**: Sign in/sign up tabs, social auth options, plan selection, benefits sidebar.\n\n11. **DASHBOARD (/dashboard)**: Member area with program library, downloads, stats, promotions.\n\n12. **AI VIDEO ADS (/services/ai-video-ads)**: Coming soon landing page. Positioning: production studio, NOT software. Hero: 'Cinematic advertising video production powered by AI' + subheadline about high-impact videos at accessible costs. Sections: The Problem (traditional video is expensive/slow), The Solution (AI as production engine with creative direction), Differentiators (5 bullet points), Visual Examples placeholder, Email signup for early access. Tone: confident, clear, professional - NO buzzwords or startup clichés.\n\n**FEATURES:**\n- Language selector (EN/PT/ES) with localStorage persistence in header\n- Responsive mobile navigation\n- Audio player components for samples\n- Scroll to top on page navigation\n- Footer on all pages with: company description (NO 'U.S.-based artistic'), contact email only, social links\n\n**IMPORTANT:**\n- Contact info: ONLY contact@luizlaffeyproductions.com everywhere\n- NO phone numbers anywhere\n- NO physical address/location\n- Image filters: brightness(1.15), contrast(1.2), saturate(1.1) on show artwork and host photos","type":"feature","passes":true,"id":1}]
